[
    {
        "id": "gs_koschei_secondary_mobility_modification",
        "name": "KOSCHEI-CLASS SECONDARY MOBILITY MODIFICATION",
        "source": "G&S",
        "description": "<i>A reflex module and series of emergency limbs installed into your mech. The reflex module is a mech-scale “muscle memory” program that helps keep the mech on its feet when put under intense stress and the emergency limbs are there in case anything important gets shot off and you need to stay mobile.</i>",
        "effect": "Your mech is Immune to the Slowed condition from sources other than yourself and may stand from prone for 1/2 of your movement allowance rather than the full move."
    },
    {
        "id": "gs_lilliputian_modifications",
        "name": "LILLIPUTIAN MODIFICATIONS",
        "source": "G&S",
        "effect": "You may reduce mech's size by 1, to a minimum of 1/2. A size 1/2 mech that takes this modification may fit through most doors. Additionally all actions against you taken as a Reaction are at +1 difficulty.",
        "description": "<i>So, the boys in the Mountain figured out a way to safely miniaturize the printing specs for most standard type frames, the usage of GMS universal parts makes it easy to do! But it takes the genius of the Grimm Clan to find a way to keep the reactor output stable when miniaturized. There’s waivers and stuff involved when you use the mods, but that’s just what Vedevois said we had to do or the DoJ’d come knocking</i>"
    },
    {
        "id": "gs_a_familys_pride",
        "name": "A FAMILY'S PRIDE",
        "source": "G&S",
        "description": "<i>One hand grips the gun, one finger pulls the trigger. But a thousand hands forged the gun. And ten thousand hands mined the ore and made the bullets. Can you say you're greater than all that? Of course not. You're another set of hands. Another part of the whole. Together we're strong. So stand tall with this. A blessing from our Family to you. To make sure you get back to your family.</i>",
        "effect": "If you would make an attack, save or skill check with net +1 difficulty, instead make the roll with no accuracy or difficulty.",
        "synergies": [{
            "locations": ["skill check", "weapon"],
            "weapon_types": ["Launcher", "Rifle", "Nexus", "Melee", "Cannon", "CQB"],
            "weapon_sizes": ["any"],
            "detail": "If you would make an attack, save or skill check with net +1 difficulty, instead make the roll with no accuracy or difficulty."
        }]
    },
    {
        "id": "gs_angels_gift_flash_printer",
        "name": "'ANGEL'S GIFT' FLASH PRINTER'",
        "source": "G&S",
        "description": "<i>Sometimes, you’re just tapped. Not enough RawMat for a real ammo-print or mine deployment. And your friends, can’t be stealing bullets and grenades from them, that’s just a good way to get shot. So whaddya do? You pull out this lil blessing. It’ll keep your tanks full as it can, but its... well the Anlamanni boys don’t recommend using it on extended deployments or if you gotta, only at the very end. S’not the most reliable stuff you get, printing off a raw coldcore hookup. But it prints, Terra does it print.</i>",
        "effect": "You may attempt to use Limited Systems and Weapons if they are out of charges, if you do so, roll 1d6. On a 4+ they work as though you had spent a charge to activate them. On any other result, the system or weapon is automatically destroyed as whatever cheapass ammo you shoved into it cooks off or a spare part goes flying and detonates the whole thing."
    },
    {
        "id": "gs_balm_of_gilead_nanoslurry_tanks",
        "name": "'BALM OF GILEAD' NANOSLURRY TANKS",
        "source": "G&S",
        "description": "<i>Upgrading the spare parts and universal repair systems inherent to mechs and enhancing them with the addition of our proprietary nanoslurry will make sure you don’t die! And really, isn’t that just the best? We use the same kinda stuff in Dorothy’s nanotanks and it comes with a manna-back-guarantee if it doesn’t save your skin at least once a deployment.</i>",
        "effect": "When you spend Repair to heal, or are healed by another player spending repair to do so; you gain 2+GRIT Overshield.",
        "synergies": [{
            "locations": ["repair"],
            "detail": "hen you spend Repair to heal, or are healed by another player spending repair to do so; you gain 2+GRIT Overshield."
        }]
    }
]
